<?php
// author: sofish, https://github.com/sofish
// licensed under: MIT

$north_america_code = array(
	'华盛顿特区' => 401010100,
	'迈阿密' => 401020101,
	'奥兰多' => 401020104,
	'亚特兰大' => 401030101,
	'洛杉矶' => 401040101,
	'圣弗朗西斯科' => 401040102,
	'波士顿' => 401060100,
	'芝加哥' => 401070101,
	'西雅图' => 401100101,
	'纽约' => 401110101,
	'休斯敦' => 401120108,
	'拉斯维加斯' => 401370100,
	'火奴鲁鲁' => 401480100,
	'渥太华' => 404010100,
	'温哥华' => 404030100,
	'多伦多' => 404040100,
	'埃德蒙顿' => 404130100,
	'卡尔加里' => 404140100,
	'温尼伯' => 404220100,
	'魁北克' => 404230100,
	'蒙特利尔' => 404240100,
	'哈瓦那' => 406010100,
	'墨西哥城' => 411010100,
	'加拉加斯' => 416010100,
);
?>
